#                                                      AICP INTERNSHIP WEEK 02

In [1]:
import pandas as pd

## Task 1

In [2]:
values = [1, 4, 9, 6, 7]

series1 = pd.Series(values, index = ['a', 'x', 'c', '2', 'e'])

series1

a    1
x    4
c    9
2    6
e    7
dtype: int64

## Task 2

In [3]:
dict1 = {
    "Tayyab": 99,
    "Baber": 83,
    "Hamza": 67
}

series2 = pd.Series(dict1)

series2

Tayyab    99
Baber     83
Hamza     67
dtype: int64

## Task 3

In [4]:
dict2 = {
    "day": ['1/1/2024', '1/1/2024','1/1/2024','1/1/2024','1/1/2024','1/1/2024'],
    "temperature": [32, 35, 28, 24, 32, 31],
    "windspeed": [6, 7, 2, 7, 4, 2],
    "event": ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']
}

df1 = pd.DataFrame(dict2)

df1

        day  temperature  windspeed  event
0  1/1/2024           32          6   Rain
1  1/1/2024           35          7  Sunny
2  1/1/2024           28          2   Snow
3  1/1/2024           24          7   Snow
4  1/1/2024           32          4   Rain
5  1/1/2024           31          2  Sunny

## Task 4

In [5]:
df1.index = ['a', 'b', 'c', 'd', 'e', 'f']

df1

        day  temperature  windspeed  event
a  1/1/2024           32          6   Rain
b  1/1/2024           35          7  Sunny
c  1/1/2024           28          2   Snow
d  1/1/2024           24          7   Snow
e  1/1/2024           32          4   Rain
f  1/1/2024           31          2  Sunny

## Task 5

In [6]:
print("Mean = ", df1['temperature'].mean())
print("Max = ", df1['temperature'].max())
print("Min = ", df1['temperature'].min())

Mean =  30.333333333333332
Max =  35
Min =  24

## Task 6

In [22]:
df = pd.read_csv("people.csv", usecols = ["First Name", "Sex", "Email", "Phone", "Job Title"], skiprows=[1, 5])

df.set_index(["Sex", "Job Title"], inplace=True)

df.to_csv('NewPeople.csv')

df.head()

                                First Name                      Email  \
Sex    Job Title
Female Phytotherapist              Phillip      bethany14@example.com
Male   Homeopath                  Kristine      bthompson@example.com
       Market researcher           Yesenia  kaitlinkaiser@example.com
       Waste management officer       Erin        tconner@example.org
Female Intelligence analyst      Katherine    conniecowan@example.com

                                                 Phone
Sex    Job Title
Female Phytotherapist                214.112.6044x4913
Male   Homeopath                          277.609.7938
       Market researcher                  584.094.6111
       Waste management officer  001-171-649-9856x5553
Female Intelligence analyst      +1-773-151-6685x49162

## Task 7

In [34]:
df1 = pd.read_excel('SampleWork.xlsx', sheet_name='Sheet1', skiprows=[2])

first_column = df1.iloc[:, 0]  # First column
last_column = df1.iloc[:, -1]  # Last column

new_df = pd.concat([first_column, last_column], axis=1)

new_df.columns = new_df.iloc[0]
new_df = new_df[1:]

new_df.to_excel('output.xlsx', index=False, sheet_name='newsheet')

new_df

0    Amir  95
1  Sufyan  85
2   Saiqa  80
3   Aimen  75

## Task 8

In [35]:
dict3 = {
    "Name": ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
    "Age": [27, 24, 32, 22, 23],
    "Address": ['Lahore', 'Karachi', 'Sialkot', 'Peshawar', 'Kohat'], 
    "Qualificaion": ['MSC', 'MA', 'MCA', 'PHD', 'BSC']
}

df = pd.DataFrame(dict3)

df

    Name  Age   Address Qualificaion
0  Sonia   27    Lahore          MSC
1  Bilal   24   Karachi           MA
2  Hifza   32   Sialkot          MCA
3  Kabir   22  Peshawar          PHD
4  Jazim   23     Kohat          BSC

In [38]:
import pandas as pd

dict3 = {
    "Name": ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
    "Age": [27, 24, 32, 22, 23],
    "Address": ['Lahore', 'Karachi', 'Sialkot', 'Peshawar', 'Kohat'],
    "Qualification": ['MSC', 'MA', 'MCA', 'PHD', 'BSC']
}

AICP_DF = pd.DataFrame(dict3) # Create DataFrame AICP_DF

df1 = AICP_DF[['Name', 'Qualification']] # Select 'Name' and 'Qualification' columns and save to df1

AICP_DF['Height'] = [5.1, 6.2, 5.1, 5.2, 5.1] # Add a new column "Height"

AICP_DF.set_index('Name', inplace=True) # Set column "Name" as the index column

row_hifza = AICP_DF.loc['Hifza'] # Retrieve row with index "Hifza"

row_index_3 = AICP_DF.iloc[3] # Retrieve row with index 3

AICP_DF.drop('Bilal', inplace=True) # Drop row with index "Bilal"

print("\ndf1:")
print(df1)
print("\nRow with index 'Hifza':")
print(row_hifza)
print("\nRow with index 3:")
print(row_index_3)

df1:
    Name Qualification
0  Sonia           MSC
1  Bilal            MA
2  Hifza           MCA
3  Kabir           PHD
4  Jazim           BSC

Row with index 'Hifza':
Age                   32
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

Row with index 3:
Age                    22
Address          Peshawar
Qualification         PHD
Height                5.2
Name: Kabir, dtype: object

In [39]:
print("Done")

Done